tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
#include <esp_idf_version.h>
#include <esp_system.h>
#include <esp_tls_errors.h>
#include <mqtt_client.h>
#include <mbedtls/x509.h>
#include "internal/Esp32BaseMqttLifecycle.h"

#include <errno.h>
#include <string.h>

namespace {

constexpr uint16_t MQTT_MIN_KEEPALIVE_SECONDS = 15;
constexpr uint16_t MQTT_MAX_KEEPALIVE_SECONDS = 1200;
constexpr size_t MQTT_MAX_HOST_BYTES = 253;
constexpr size_t MQTT_MAX_CLIENT_ID_BYTES = 64;
constexpr size_t MQTT_MAX_USERNAME_BYTES = 128;
constexpr size_t MQTT_MAX_PASSWORD_BYTES = 256;
constexpr uint32_t MQTT_BACKOFF_INITIAL_MS = 1000;
constexpr uint32_t MQTT_BACKOFF_MAX_MS = 60000;
constexpr uint8_t MQTT_NO_SLOT = 0xFF;
#if defined(CONFIG_MBEDTLS_HAVE_TIME_DATE) && CONFIG_MBEDTLS_HAVE_TIME_DATE
constexpr bool MQTT_CERTIFICATE_DATE_CHECK_ENABLED = true;
#else
constexpr bool MQTT_CERTIFICATE_DATE_CHECK_ENABLED = false;
#endif

enum RawEventType : uint8_t {
    RAW_CONNECTED,
    RAW_DISCONNECTED,
    RAW_ERROR,
    RAW_CONFIGURATION_FAILED,
    RAW_SUBSCRIBED,
    RAW_PUBLISHED
};

struct RawEvent {
    RawEventType type = RAW_DISCONNECTED;
    int32_t packetId = 0;
    bool subscriptionRejected = false;
    uint8_t grantedQos = 0xFF;
    int32_t errorType = 0;
    int32_t connectReturnCode = 0;
    int32_t espError = 0;
    int32_t tlsError = 0;
    int32_t socketError = 0;
    uint32_t certificateFlags = 0;
};

enum IncomingSlotState : uint8_t {
    INCOMING_EMPTY,
    INCOMING_ASSEMBLING,
    INCOMING_READY,
    INCOMING_DISPATCHING
};

struct IncomingSlot {
    IncomingSlotState state = INCOMING_EMPTY;
    int32_t packetId = 0;
    char topic[ESP32BASE_MQTT_MAX_TOPIC_BYTES + 1] = {};
    uint16_t topicLength = 0;
    uint16_t payloadLength = 0;
    Esp32BaseMqtt::QualityOfService qos = Esp32BaseMqtt::QOS_0;
    bool retain = false;
    bool duplicate = false;
    uint8_t payload[ESP32BASE_MQTT_MAX_INCOMING_PAYLOAD_BYTES] = {};
};

struct SubscriptionEntry {
    const char* topicFilter = nullptr;
    Esp32BaseMqtt::QualityOfService qos = Esp32BaseMqtt::QOS_0;
    int32_t pendingPacketId = -1;
};

struct InflightEntry {
    bool used = false;
    uint16_t packetId = 0;
};

portMUX_TYPE g_mqttMux = portMUX_INITIALIZER_UNLOCKED;
Esp32BaseMqtt::ConnectionConfig g_mqttConfig;
SubscriptionEntry g_mqttSubscriptions[ESP32BASE_MQTT_MAX_SUBSCRIPTIONS];
uint8_t g_mqttSubscriptionCount = 0;
InflightEntry g_mqttInflight[ESP32BASE_MQTT_MAX_INFLIGHT_QOS1];
IncomingSlot g_mqttIncoming[ESP32BASE_MQTT_INCOMING_SLOTS];
RawEvent g_mqttEvents[ESP32BASE_MQTT_EVENT_SLOTS];
uint8_t g_mqttEventRead = 0;
uint8_t g_mqttEventWrite = 0;
uint8_t g_mqttEventCount = 0;
int8_t g_mqttAssemblySlot = -1;
int32_t g_mqttDroppingPacketId = -1;
bool g_mqttConfigured = false;
bool g_mqttConfigurationAttempted = false;
bool g_mqttBegun = false;
bool g_mqttTerminalRejection = false;
bool g_mqttConnectionConfigurationFailed = false;
bool g_mqttEverConnected = false;
bool g_mqttOtaSuspended = false;
bool g_mqttReconnectRequested = false;
bool g_mqttForceReconnectAfterDisconnect = false;
bool g_mqttConnectionWanted = true;
bool g_mqttNativeConnected = false; // MQTT task writes under g_mqttMux.
bool g_mqttShutdownActive = false;
bool g_mqttShutdownAcked = false;
bool g_mqttMaintenanceDraining = false;
uint16_t g_mqttShutdownPacket = 0;
uint32_t g_mqttShutdownDeadline = 0;
uint32_t g_mqttShutdownMailboxDrops = 0;
Esp32BaseMqtt::ShutdownResult g_mqttShutdownResult = Esp32BaseMqtt::SHUTDOWN_NONE;
esp_mqtt_client_handle_t g_mqttClient = nullptr;
Esp32BaseMqtt::State g_mqttState = Esp32BaseMqtt::NOT_CONFIGURED;
Esp32BaseMqtt::Error g_mqttLastError = Esp32BaseMqtt::ERROR_NONE;
Esp32BaseMqtt::Error g_mqttPendingDisconnectError =
    Esp32BaseMqtt::ERROR_DISCONNECTED;
Esp32BaseMqtt::Diagnostics g_mqttDiagnostics;
uint32_t g_mqttNextAttemptMs = 0;
uint8_t g_mqttBackoffStep = 0;
uint32_t g_mqttReportedMailboxDrops = 0;
uint32_t g_mqttReportedIncomingDrops = 0;
uint32_t g_mqttConnectedAtUptimeMs = 0;
uint32_t g_mqttConnectedAtEpochSec = 0;
Esp32BaseMqtt::MessageCallback g_mqttMessageCallback = nullptr;
void* g_mqttMessageContext = nullptr;
Esp32BaseMqtt::EventCallback g_mqttEventCallback = nullptr;
void* g_mqttEventContext = nullptr;
Esp32BaseMqtt::BeforeConnectCallback g_mqttBeforeConnectCallback = nullptr;
void* g_mqttBeforeConnectContext = nullptr;

size_t boundedLength(const char* value, size_t maximum) {
    if (!value) {
        return 0;
    }
    size_t length = 0;
    while (length <= maximum && value[length] != '\0') {
        ++length;
    }
    return length;
}

bool validRequiredString(const char* value, size_t maximum) {
    const size_t length = boundedLength(value, maximum);
    return length > 0 && length <= maximum;
}

bool validOptionalString(const char* value, size_t maximum) {
    return !value || boundedLength(value, maximum) <= maximum;
}

bool validPublishTopic(const char* topic) {
    if (!validRequiredString(topic, ESP32BASE_MQTT_MAX_TOPIC_BYTES)) {
        return false;
    }
    return strchr(topic, '#') == nullptr && strchr(topic, '+') == nullptr;
}

bool validTopicFilter(const char* filter) {
    if (!validRequiredString(filter, ESP32BASE_MQTT_MAX_TOPIC_BYTES)) {
        return false;
    }
    for (size_t i = 0; filter[i] != '\0'; ++i) {
        if (filter[i] == '#') {
            if (filter[i + 1] != '\0' || (i > 0 && filter[i - 1] != '/')) {
                return false;
            }
        } else if (filter[i] == '+') {
            const bool startsLevel = i == 0 || filter[i - 1] == '/';
            const bool endsLevel = filter[i + 1] == '\0' || filter[i + 1] == '/';
            if (!startsLevel || !endsLevel) {
                return false;
            }
        }
    }
    return true;
}

bool validPem(const char* pem, size_t length, size_t maximum) {
    if (!pem || length < 2 || length > maximum) {
        return false;
    }
    const size_t visibleLength = boundedLength(pem, maximum - 1);
    return visibleLength > 0 &&
           visibleLength + 1 == length &&
           strcmp(pem, "NULL") != 0;
}

