tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
bool validCertificatePem(const char* pem, size_t length, size_t maximum) {
    return validPem(pem, length, maximum) &&
           strstr(pem, "-----BEGIN CERTIFICATE-----") != nullptr &&
           strstr(pem, "-----END CERTIFICATE-----") != nullptr;
}

bool validateConnectionConfig(const Esp32BaseMqtt::ConnectionConfig& config,
                              Esp32BaseMqtt::Error& error) {
    error = Esp32BaseMqtt::ERROR_INVALID_CONFIGURATION;
    if (!validRequiredString(config.host, MQTT_MAX_HOST_BYTES) ||
        !validRequiredString(config.clientId, MQTT_MAX_CLIENT_ID_BYTES) ||
        config.port == 0 ||
        config.keepAliveSeconds < MQTT_MIN_KEEPALIVE_SECONDS ||
        config.keepAliveSeconds > MQTT_MAX_KEEPALIVE_SECONDS ||
        !validOptionalString(config.username, MQTT_MAX_USERNAME_BYTES) ||
        !validOptionalString(config.password, MQTT_MAX_PASSWORD_BYTES) ||
        (config.password && !config.username) ||
        (config.security != Esp32BaseMqtt::TLS &&
         config.security != Esp32BaseMqtt::EXPLICIT_PLAINTEXT)) {
        return false;
    }

    if (config.security == Esp32BaseMqtt::TLS) {
        if (!validCertificatePem(config.tls.caCertificatePem,
                                 config.tls.caCertificateLength,
                                 ESP32BASE_MQTT_MAX_CA_CERT_BYTES)) {
            return false;
        }
        const bool clientCertificateSet =
            config.tls.clientCertificatePem ||
            config.tls.clientCertificateLength != 0;
        const bool privateKeySet =
            config.tls.privateKeyPem || config.tls.privateKeyLength != 0;
        if (clientCertificateSet != privateKeySet ||
            (clientCertificateSet &&
             (!validCertificatePem(config.tls.clientCertificatePem,
                                   config.tls.clientCertificateLength,
                                   ESP32BASE_MQTT_MAX_IDENTITY_PEM_BYTES) ||
              !validPem(config.tls.privateKeyPem,
                        config.tls.privateKeyLength,
                        ESP32BASE_MQTT_MAX_IDENTITY_PEM_BYTES)))) {
            return false;
        }
#if !ESP32BASE_MQTT_ALLOW_UNCHECKED_CERTIFICATE_DATES
        if (!MQTT_CERTIFICATE_DATE_CHECK_ENABLED) {
            error =
                Esp32BaseMqtt::ERROR_TLS_CERTIFICATE_DATE_CHECK_UNAVAILABLE;
            return false;
        }
#endif
#if !ESP32BASE_ENABLE_NTP
        return false;
#endif
    } else {
#if !ESP32BASE_MQTT_ALLOW_PLAINTEXT
        return false;
#endif
        if (config.tls.caCertificatePem ||
            config.tls.clientCertificatePem ||
            config.tls.privateKeyPem) {
            return false;
        }
    }

    if (config.lastWill &&
        (!validPublishTopic(config.lastWill->topic) ||
         config.lastWill->payloadLength > ESP32BASE_MQTT_MAX_PAYLOAD_BYTES ||
         (config.lastWill->payloadLength > 0 && !config.lastWill->payload) ||
         (config.lastWill->qos != Esp32BaseMqtt::QOS_0 &&
          config.lastWill->qos != Esp32BaseMqtt::QOS_1))) {
        return false;
    }

    error = Esp32BaseMqtt::ERROR_NONE;
    return true;
}

bool deadlineReached(uint32_t now, uint32_t deadline) {
    return static_cast<int32_t>(now - deadline) >= 0;
}

uint8_t incomingUsedLocked() {
    uint8_t used = 0;
    for (uint8_t i = 0; i < ESP32BASE_MQTT_INCOMING_SLOTS; ++i) {
        if (g_mqttIncoming[i].state != INCOMING_EMPTY) {
            ++used;
        }
    }
    return used;
}

void updateIncomingHighWaterLocked() {
    const uint8_t used = incomingUsedLocked();
    if (used > g_mqttDiagnostics.incomingHighWater) {
        g_mqttDiagnostics.incomingHighWater = used;
    }
}

bool pushRawEvent(const RawEvent& event) {
    bool accepted = false;
    portENTER_CRITICAL(&g_mqttMux);
    if (g_mqttEventCount < ESP32BASE_MQTT_EVENT_SLOTS) {
        g_mqttEvents[g_mqttEventWrite] = event;
        g_mqttEventWrite = static_cast<uint8_t>((g_mqttEventWrite + 1) % ESP32BASE_MQTT_EVENT_SLOTS);
        ++g_mqttEventCount;
        if (g_mqttEventCount > g_mqttDiagnostics.controlEventHighWater) {
            g_mqttDiagnostics.controlEventHighWater = g_mqttEventCount;
        }
        accepted = true;
    } else if (event.type == RAW_CONNECTED ||
               event.type == RAW_DISCONNECTED ||
               event.type == RAW_ERROR ||
               event.type == RAW_CONFIGURATION_FAILED) {
        // Preserve connection truth even under an ACK burst. Drop the oldest
        // lower-priority event and retain the newest state/error event.
        g_mqttEvents[g_mqttEventWrite] = event;
        g_mqttEventWrite =
            static_cast<uint8_t>((g_mqttEventWrite + 1) % ESP32BASE_MQTT_EVENT_SLOTS);
        g_mqttEventRead = g_mqttEventWrite;
        ++g_mqttDiagnostics.controlEventDropped;
        accepted = true;
    } else {
        ++g_mqttDiagnostics.controlEventDropped;
    }
    portEXIT_CRITICAL(&g_mqttMux);
    return accepted;
}

bool popRawEvent(RawEvent& event) {
    bool available = false;
    portENTER_CRITICAL(&g_mqttMux);
    if (g_mqttEventCount > 0) {
        event = g_mqttEvents[g_mqttEventRead];
        g_mqttEventRead = static_cast<uint8_t>((g_mqttEventRead + 1) % ESP32BASE_MQTT_EVENT_SLOTS);
        --g_mqttEventCount;
        available = true;
    }
    portEXIT_CRITICAL(&g_mqttMux);
    return available;
}

void emitApplicationEvent(Esp32BaseMqtt::EventType type,
                          Esp32BaseMqtt::Error error = Esp32BaseMqtt::ERROR_NONE,
                          uint16_t packetId = 0,
                          uint8_t subscriptionIndex = MQTT_NO_SLOT,
                          uint8_t grantedQos = 0xFF) {
    if (!g_mqttEventCallback || g_mqttMaintenanceDraining) {
        return;
    }
    Esp32BaseMqtt::Event event;
    event.type = type;
    event.error = error;
    event.packetId = packetId;
    event.subscriptionIndex = subscriptionIndex;
    event.grantedQos = grantedQos;
    g_mqttEventCallback(event, g_mqttEventContext);
}

uint8_t reserveIncomingSlot(int32_t packetId) {
    uint8_t selected = MQTT_NO_SLOT;
    portENTER_CRITICAL(&g_mqttMux);
    for (uint8_t i = 0; i < ESP32BASE_MQTT_INCOMING_SLOTS; ++i) {
        if (g_mqttIncoming[i].state == INCOMING_EMPTY) {
            g_mqttIncoming[i].state = INCOMING_ASSEMBLING;
            g_mqttIncoming[i].packetId = packetId;
            selected = i;
            updateIncomingHighWaterLocked();
            break;
        }
    }
    if (selected == MQTT_NO_SLOT) {
        ++g_mqttDiagnostics.incomingMailboxDropped;
    }
    portEXIT_CRITICAL(&g_mqttMux);
    return selected;
}

