tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
void abandonAssembly() {
    portENTER_CRITICAL(&g_mqttMux);
    if (g_mqttAssemblySlot >= 0 &&
        g_mqttIncoming[g_mqttAssemblySlot].state == INCOMING_ASSEMBLING) {
        g_mqttIncoming[g_mqttAssemblySlot].state = INCOMING_EMPTY;
    }
    g_mqttAssemblySlot = -1;
    portEXIT_CRITICAL(&g_mqttMux);
}

void finishDroppingIfComplete(const esp_mqtt_event_t* event) {
    const int64_t fragmentEnd =
        static_cast<int64_t>(event->current_data_offset) + event->data_len;
    if (fragmentEnd >= event->total_data_len) {
        g_mqttDroppingPacketId = -1;
    }
}

void handleIncomingData(const esp_mqtt_event_t* event) {
    const int64_t fragmentEnd =
        event ? static_cast<int64_t>(event->current_data_offset) + event->data_len : 0;
    if (!event || event->data_len < 0 || event->total_data_len < 0 ||
        event->current_data_offset < 0 ||
        fragmentEnd > event->total_data_len) {
        portENTER_CRITICAL(&g_mqttMux);
        ++g_mqttDiagnostics.incomingOversizeDropped;
        portEXIT_CRITICAL(&g_mqttMux);
        abandonAssembly();
        return;
    }

    if (g_mqttDroppingPacketId == event->msg_id) {
        finishDroppingIfComplete(event);
        return;
    }

    if (event->current_data_offset == 0) {
        abandonAssembly();
        if (!event->topic || event->topic_len <= 0 ||
            event->topic_len > ESP32BASE_MQTT_MAX_TOPIC_BYTES ||
            memchr(event->topic, '\0', static_cast<size_t>(event->topic_len)) != nullptr ||
            event->total_data_len > ESP32BASE_MQTT_MAX_INCOMING_PAYLOAD_BYTES) {
            portENTER_CRITICAL(&g_mqttMux);
            ++g_mqttDiagnostics.incomingOversizeDropped;
            portEXIT_CRITICAL(&g_mqttMux);
            g_mqttDroppingPacketId = event->msg_id;
            finishDroppingIfComplete(event);
            return;
        }

        const uint8_t slotIndex = reserveIncomingSlot(event->msg_id);
        if (slotIndex == MQTT_NO_SLOT) {
            g_mqttDroppingPacketId = event->msg_id;
            finishDroppingIfComplete(event);
            return;
        }

        IncomingSlot& slot = g_mqttIncoming[slotIndex];
        memcpy(slot.topic, event->topic, static_cast<size_t>(event->topic_len));
        slot.topic[event->topic_len] = '\0';
        slot.topicLength = static_cast<uint16_t>(event->topic_len);
        slot.payloadLength = static_cast<uint16_t>(event->total_data_len);
        slot.qos = event->qos == 1 ? Esp32BaseMqtt::QOS_1 : Esp32BaseMqtt::QOS_0;
        slot.retain = event->retain;
        slot.duplicate = event->dup;
        g_mqttAssemblySlot = static_cast<int8_t>(slotIndex);
    }

    if (g_mqttAssemblySlot < 0) {
        portENTER_CRITICAL(&g_mqttMux);
        ++g_mqttDiagnostics.incomingOversizeDropped;
        portEXIT_CRITICAL(&g_mqttMux);
        g_mqttDroppingPacketId = event->msg_id;
        finishDroppingIfComplete(event);
        return;
    }

    IncomingSlot& slot = g_mqttIncoming[g_mqttAssemblySlot];
    if (slot.packetId != event->msg_id ||
        fragmentEnd > slot.payloadLength) {
        portENTER_CRITICAL(&g_mqttMux);
        ++g_mqttDiagnostics.incomingOversizeDropped;
        portEXIT_CRITICAL(&g_mqttMux);
        abandonAssembly();
        g_mqttDroppingPacketId = event->msg_id;
        finishDroppingIfComplete(event);
        return;
    }

    if (event->data_len > 0) {
        memcpy(slot.payload + event->current_data_offset,
               event->data,
               static_cast<size_t>(event->data_len));
    }
    if (fragmentEnd == event->total_data_len) {
        portENTER_CRITICAL(&g_mqttMux);
        slot.state = INCOMING_READY;
        ++g_mqttDiagnostics.receivedMessages;
        g_mqttDiagnostics.receivedBytes += static_cast<uint32_t>(slot.payloadLength);
        g_mqttAssemblySlot = -1;
        portEXIT_CRITICAL(&g_mqttMux);
    }
}

void submitSubscriptionsFromMqttTask(esp_mqtt_client_handle_t client) {
    for (uint8_t i = 0; i < g_mqttSubscriptionCount; ++i) {
        const int packetId = esp_mqtt_client_subscribe(
            client,
            g_mqttSubscriptions[i].topicFilter,
            static_cast<int>(g_mqttSubscriptions[i].qos));
        portENTER_CRITICAL(&g_mqttMux);
        g_mqttSubscriptions[i].pendingPacketId = packetId;
        portEXIT_CRITICAL(&g_mqttMux);
        if (packetId < 0) {
            RawEvent rejected;
            rejected.type = RAW_SUBSCRIBED;
            rejected.packetId = -1 - static_cast<int32_t>(i);
            pushRawEvent(rejected);
        }
    }
}

void fillNativeConfig(esp_mqtt_client_config_t& nativeConfig);

void mqttEventHandler(void*, esp_event_base_t, int32_t eventId, void* eventData) {
    esp_mqtt_event_t* event = static_cast<esp_mqtt_event_t*>(eventData);
    if (!event) {
        return;
    }

    if (eventId == MQTT_EVENT_DATA) {
        handleIncomingData(event);
        return;
    }

    RawEvent raw;
    switch (eventId) {
        case MQTT_EVENT_BEFORE_CONNECT: {
            esp_mqtt_client_config_t nativeConfig;
            fillNativeConfig(nativeConfig);
            const esp_err_t result =
                esp_mqtt_set_config(event->client, &nativeConfig);
            if (result != ESP_OK) {
                portENTER_CRITICAL(&g_mqttMux);
                g_mqttConnectionWanted = false;
                portEXIT_CRITICAL(&g_mqttMux);
                raw.type = RAW_CONFIGURATION_FAILED;
                raw.espError = result;
                pushRawEvent(raw);
                esp_mqtt_client_disconnect(event->client);
            }
            break;
        }
        case MQTT_EVENT_CONNECTED: {
            portENTER_CRITICAL(&g_mqttMux);
            g_mqttNativeConnected = true;
            const bool connectionWanted = g_mqttConnectionWanted;
            portEXIT_CRITICAL(&g_mqttMux);
            if (!connectionWanted) {
                esp_mqtt_client_disconnect(event->client);
                return;
            }
            submitSubscriptionsFromMqttTask(event->client);
            raw.type = RAW_CONNECTED;
            pushRawEvent(raw);
            break;
        }
        case MQTT_EVENT_DISCONNECTED:
            // Do not deliver commands buffered in a previous connection.
            // An application callback already running owns its slot until return.
            portENTER_CRITICAL(&g_mqttMux);
            g_mqttNativeConnected = false;
            for (auto& slot : g_mqttIncoming) {
                if (slot.state == INCOMING_READY || slot.state == INCOMING_ASSEMBLING) {
                    slot.state = INCOMING_EMPTY;
                    ++g_mqttDiagnostics.incomingMailboxDropped;
                }
            }
            g_mqttAssemblySlot = -1;
            g_mqttDroppingPacketId = -1;
            portEXIT_CRITICAL(&g_mqttMux);
            raw.type = RAW_DISCONNECTED;
            pushRawEvent(raw);
            break;
        case MQTT_EVENT_SUBSCRIBED:
            raw.type = RAW_SUBSCRIBED;
            raw.packetId = event->msg_id;
            if (event->data && event->data_len == 1 &&
                static_cast<uint8_t>(event->data[0]) <= 2) {
                raw.grantedQos = static_cast<uint8_t>(event->data[0]);
            }
            for (int i = 0; event->data && i < event->data_len; ++i) {
                if (static_cast<uint8_t>(event->data[i]) >= 0x80) {
                    raw.subscriptionRejected = true;
                    break;
                }
            }
            pushRawEvent(raw);
            break;
        case MQTT_EVENT_PUBLISHED:
            raw.type = RAW_PUBLISHED;
            raw.packetId = event->msg_id;
            pushRawEvent(raw);
            break;
        case MQTT_EVENT_ERROR:
            raw.type = RAW_ERROR;
            if (event->error_handle) {
                raw.errorType = event->error_handle->error_type;
                raw.connectReturnCode = event->error_handle->connect_return_code;
                raw.espError = event->error_handle->esp_tls_last_esp_err;
                raw.tlsError = event->error_handle->esp_tls_stack_err;
                raw.socketError = event->error_handle->esp_transport_sock_errno;
                raw.certificateFlags =
                    static_cast<uint32_t>(event->error_handle->esp_tls_cert_verify_flags);
            }
            pushRawEvent(raw);
            break;
        default:
            break;
    }
}

void fillNativeConfig(esp_mqtt_client_config_t& nativeConfig) {
    memset(&nativeConfig, 0, sizeof(nativeConfig));
    const bool tls = g_mqttConfig.security == Esp32BaseMqtt::TLS;
#if ESP_IDF_VERSION_MAJOR >= 5
    nativeConfig.broker.address.hostname = g_mqttConfig.host;
    nativeConfig.broker.address.port = g_mqttConfig.port;
    nativeConfig.broker.address.transport =
        tls ? MQTT_TRANSPORT_OVER_SSL : MQTT_TRANSPORT_OVER_TCP;
    nativeConfig.broker.verification.certificate =
        tls ? g_mqttConfig.tls.caCertificatePem : nullptr;
    nativeConfig.broker.verification.certificate_len = 0;
    nativeConfig.broker.verification.skip_cert_common_name_check = false;
    nativeConfig.credentials.client_id = g_mqttConfig.clientId;
    nativeConfig.credentials.username = g_mqttConfig.username;
    nativeConfig.credentials.authentication.password = g_mqttConfig.password;
    nativeConfig.credentials.authentication.certificate =
        tls ? g_mqttConfig.tls.clientCertificatePem : nullptr;
    nativeConfig.credentials.authentication.certificate_len = 0;
    nativeConfig.credentials.authentication.key =
        tls ? g_mqttConfig.tls.privateKeyPem : nullptr;
    nativeConfig.credentials.authentication.key_len = 0;
    nativeConfig.session.disable_clean_session = false;
    nativeConfig.session.keepalive = g_mqttConfig.keepAliveSeconds;
    nativeConfig.session.protocol_ver = MQTT_PROTOCOL_V_3_1_1;
    if (g_mqttConfig.lastWill) {
        nativeConfig.session.last_will.topic = g_mqttConfig.lastWill->topic;
        nativeConfig.session.last_will.msg =
            reinterpret_cast<const char*>(g_mqttConfig.lastWill->payload);
        nativeConfig.session.last_will.msg_len =
            static_cast<int>(g_mqttConfig.lastWill->payloadLength);
        nativeConfig.session.last_will.qos = static_cast<int>(g_mqttConfig.lastWill->qos);
        nativeConfig.session.last_will.retain = g_mqttConfig.lastWill->retain ? 1 : 0;
    }
    nativeConfig.network.disable_auto_reconnect = true;
    nativeConfig.network.timeout_ms = 10000;
    nativeConfig.task.stack_size = ESP32BASE_MQTT_TASK_STACK_BYTES;
    nativeConfig.task.priority = 5;
    nativeConfig.buffer.size = 1024;
    nativeConfig.buffer.out_size = 1024;
    nativeConfig.outbox.limit = ESP32BASE_MQTT_MAX_OUTBOX_BYTES;
#else
    nativeConfig.host = g_mqttConfig.host;
    nativeConfig.port = g_mqttConfig.port;
    nativeConfig.transport = tls ? MQTT_TRANSPORT_OVER_SSL : MQTT_TRANSPORT_OVER_TCP;
    nativeConfig.cert_pem = tls ? g_mqttConfig.tls.caCertificatePem : nullptr;
    nativeConfig.cert_len = 0;
    nativeConfig.skip_cert_common_name_check = false;
    nativeConfig.client_id = g_mqttConfig.clientId;
    nativeConfig.username = g_mqttConfig.username;
    nativeConfig.password = g_mqttConfig.password;
    nativeConfig.client_cert_pem =
        tls ? g_mqttConfig.tls.clientCertificatePem : nullptr;
    nativeConfig.client_cert_len = 0;
    nativeConfig.client_key_pem =
        tls ? g_mqttConfig.tls.privateKeyPem : nullptr;
    nativeConfig.client_key_len = 0;
    nativeConfig.disable_clean_session = false;
    nativeConfig.keepalive = g_mqttConfig.keepAliveSeconds;
    nativeConfig.protocol_ver = MQTT_PROTOCOL_V_3_1_1;
    if (g_mqttConfig.lastWill) {
        nativeConfig.lwt_topic = g_mqttConfig.lastWill->topic;
        nativeConfig.lwt_msg = reinterpret_cast<const char*>(g_mqttConfig.lastWill->payload);
        nativeConfig.lwt_msg_len = static_cast<int>(g_mqttConfig.lastWill->payloadLength);
        nativeConfig.lwt_qos = static_cast<int>(g_mqttConfig.lastWill->qos);
        nativeConfig.lwt_retain = g_mqttConfig.lastWill->retain ? 1 : 0;
    }
    nativeConfig.disable_auto_reconnect = true;
    nativeConfig.network_timeout_ms = 10000;
    nativeConfig.task_stack = ESP32BASE_MQTT_TASK_STACK_BYTES;
    nativeConfig.task_prio = 5;
    nativeConfig.buffer_size = 1024;
    nativeConfig.out_buffer_size = 1024;
#endif
}

void clearInflight(bool notifyUncertain) {
    for (uint8_t i = 0; i < ESP32BASE_MQTT_MAX_INFLIGHT_QOS1; ++i) {
        uint16_t packetId = 0;
        portENTER_CRITICAL(&g_mqttMux);
        if (g_mqttInflight[i].used) {
            packetId = g_mqttInflight[i].packetId;
            g_mqttInflight[i].used = false;
            if (notifyUncertain) {
                ++g_mqttDiagnostics.publishDeliveryUncertain;
            }
        }
        portEXIT_CRITICAL(&g_mqttMux);
        if (packetId != 0 && notifyUncertain) {
            emitApplicationEvent(Esp32BaseMqtt::EVENT_PUBLISH_DELIVERY_UNCERTAIN,
                                 Esp32BaseMqtt::ERROR_DISCONNECTED,
                                 packetId);
        }
    }
}

void destroyUnstartedMqttClient() {
    if (!g_mqttClient) {
        return;
    }
    esp_mqtt_client_destroy(g_mqttClient);
    g_mqttClient = nullptr;
}

