tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
esp_err_t requestNativeDisconnect() {
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttConnectionWanted = false;
    portEXIT_CRITICAL(&g_mqttMux);
    if (g_mqttClient) {
        // This only sets ESP-MQTT's disconnect bit and returns. Never call
        // esp_mqtt_client_stop() from handle(): that API may wait forever.
        return esp_mqtt_client_disconnect(g_mqttClient);
    }
    return ESP_FAIL;
}

bool isConnectionWanted() {
    portENTER_CRITICAL(&g_mqttMux);
    const bool wanted = g_mqttConnectionWanted;
    portEXIT_CRITICAL(&g_mqttMux);
    return wanted;
}

void setState(Esp32BaseMqtt::State state) {
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttState = state;
    portEXIT_CRITICAL(&g_mqttMux);
}

void setLastError(Esp32BaseMqtt::Error error) {
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttLastError = error;
    portEXIT_CRITICAL(&g_mqttMux);
}

void scheduleBackoff() {
    const uint8_t shift = g_mqttBackoffStep > 6 ? 6 : g_mqttBackoffStep;
    uint32_t ceiling = MQTT_BACKOFF_INITIAL_MS << shift;
    if (ceiling > MQTT_BACKOFF_MAX_MS) {
        ceiling = MQTT_BACKOFF_MAX_MS;
    }
    const uint32_t floor = ceiling / 2;
    const uint32_t span = ceiling - floor + 1;
    const uint32_t delayMs = floor + (esp_random() % span);
    g_mqttNextAttemptMs = millis() + delayMs;
    if (g_mqttBackoffStep < 7) {
        ++g_mqttBackoffStep;
    }
    setState(Esp32BaseMqtt::BACKOFF);
}

Esp32BaseMqtt::Error classifyError(const RawEvent& raw, bool& terminal) {
    terminal = false;
    if (raw.errorType == MQTT_ERROR_TYPE_CONNECTION_REFUSED) {
        switch (raw.connectReturnCode) {
            case MQTT_CONNECTION_REFUSE_PROTOCOL:
                terminal = true;
                return Esp32BaseMqtt::ERROR_PROTOCOL_REJECTED;
            case MQTT_CONNECTION_REFUSE_ID_REJECTED:
                terminal = true;
                return Esp32BaseMqtt::ERROR_CLIENT_ID_REJECTED;
            case MQTT_CONNECTION_REFUSE_BAD_USERNAME:
                terminal = true;
                return Esp32BaseMqtt::ERROR_BAD_CREDENTIALS;
            case MQTT_CONNECTION_REFUSE_NOT_AUTHORIZED:
                terminal = true;
                return Esp32BaseMqtt::ERROR_NOT_AUTHORIZED;
            case MQTT_CONNECTION_REFUSE_SERVER_UNAVAILABLE:
                return Esp32BaseMqtt::ERROR_BROKER_UNAVAILABLE;
            default:
                return Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT;
        }
    }
    // ESP-TLS may omit verification flags when the peer certificate is no
    // longer retained. Its X.509 verification error still identifies a
    // terminal certificate failure; keep both SDK error sign conventions.
    if (raw.certificateFlags != 0 ||
        raw.tlsError == MBEDTLS_ERR_X509_CERT_VERIFY_FAILED ||
        raw.tlsError == -MBEDTLS_ERR_X509_CERT_VERIFY_FAILED) {
        terminal = true;
        return Esp32BaseMqtt::ERROR_TLS_CERTIFICATE;
    }
    if (raw.espError == ESP_ERR_ESP_TLS_CANNOT_RESOLVE_HOSTNAME ||
        raw.espError == ESP_ERR_ESP_TLS_CANNOT_CREATE_SOCKET ||
        raw.espError == ESP_ERR_ESP_TLS_UNSUPPORTED_PROTOCOL_FAMILY ||
        raw.espError == ESP_ERR_ESP_TLS_FAILED_CONNECT_TO_HOST ||
        raw.espError == ESP_ERR_ESP_TLS_SOCKET_SETOPT_FAILED ||
        raw.espError == ESP_ERR_ESP_TLS_CONNECTION_TIMEOUT
#ifdef ESP_ERR_ESP_TLS_TCP_CLOSED_FIN
        || raw.espError == ESP_ERR_ESP_TLS_TCP_CLOSED_FIN
#endif
    ) {
        return Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT;
    }
    if (g_mqttConfig.security == Esp32BaseMqtt::TLS &&
        (raw.tlsError != 0 || raw.espError != 0)) {
        return Esp32BaseMqtt::ERROR_TLS;
    }
    return Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT;
}

void dispatchMailboxOverflowIfNeeded() {
    uint32_t current = 0;
    portENTER_CRITICAL(&g_mqttMux);
    current = g_mqttDiagnostics.controlEventDropped;
    portEXIT_CRITICAL(&g_mqttMux);
    if (current != g_mqttReportedMailboxDrops) {
        g_mqttReportedMailboxDrops = current;
        emitApplicationEvent(Esp32BaseMqtt::EVENT_MAILBOX_OVERFLOW);
    }
}

void dispatchIncomingDropIfNeeded() {
    uint32_t current = 0;
    portENTER_CRITICAL(&g_mqttMux);
    current = g_mqttDiagnostics.incomingOversizeDropped +
              g_mqttDiagnostics.incomingMailboxDropped;
    portEXIT_CRITICAL(&g_mqttMux);
    if (current != g_mqttReportedIncomingDrops) {
        g_mqttReportedIncomingDrops = current;
        emitApplicationEvent(Esp32BaseMqtt::EVENT_INCOMING_MESSAGE_DROPPED);
    }
}

void handleRawEvents() {
    RawEvent raw;
    while (popRawEvent(raw)) {
        switch (raw.type) {
            case RAW_CONNECTED: {
                if (g_mqttOtaSuspended || !isConnectionWanted()) {
                    requestNativeDisconnect();
                    setState(g_mqttOtaSuspended
                                 ? Esp32BaseMqtt::SUSPENDED_FOR_OTA
                                 : Esp32BaseMqtt::BACKOFF);
                    break;
                }
                const bool reconnect = g_mqttEverConnected;
                g_mqttEverConnected = true;
                g_mqttTerminalRejection = false;
                g_mqttBackoffStep = 0;
                g_mqttPendingDisconnectError =
                    Esp32BaseMqtt::ERROR_DISCONNECTED;
                g_mqttConnectedAtUptimeMs = millis();
                const Esp32BaseTime::Snapshot snapshot = Esp32BaseTime::snapshot();
                g_mqttConnectedAtEpochSec = snapshot.synced ? snapshot.epochSec : 0;
                portENTER_CRITICAL(&g_mqttMux);
                ++g_mqttDiagnostics.successfulConnections;
                if (reconnect) {
                    ++g_mqttDiagnostics.reconnects;
                }
                g_mqttLastError = Esp32BaseMqtt::ERROR_NONE;
                portEXIT_CRITICAL(&g_mqttMux);
                setState(Esp32BaseMqtt::CONNECTED);
                ESP32BASE_LOG_I("mqtt",
                                "connected host=%s port=%u client_id=%s tls=%s",
                                g_mqttConfig.host,
                                static_cast<unsigned>(g_mqttConfig.port),
                                g_mqttConfig.clientId,
                                g_mqttConfig.security == Esp32BaseMqtt::TLS ? "true" : "false");
                emitApplicationEvent(Esp32BaseMqtt::EVENT_CONNECTED);
                break;
            }
            case RAW_ERROR: {
                bool terminal = false;
                const Esp32BaseMqtt::Error error = classifyError(raw, terminal);
                portENTER_CRITICAL(&g_mqttMux);
                g_mqttLastError = error;
                g_mqttPendingDisconnectError = error;
                g_mqttDiagnostics.nativeEspError = raw.espError;
                g_mqttDiagnostics.nativeTlsError = raw.tlsError;
                g_mqttDiagnostics.nativeSocketError = raw.socketError;
                g_mqttDiagnostics.nativeCertificateFlags = raw.certificateFlags;
                portEXIT_CRITICAL(&g_mqttMux);
                g_mqttTerminalRejection = terminal;
                if (g_mqttShutdownActive &&
                    g_mqttShutdownResult == Esp32BaseMqtt::SHUTDOWN_IN_PROGRESS) {
                    g_mqttShutdownResult = Esp32BaseMqtt::SHUTDOWN_CONNECTION_LOST;
                }
                ESP32BASE_LOG_W("mqtt",
                                "connection_error host=%s port=%u error=%s esp=%ld tls=%ld socket=%ld cert_flags=%lu credential_set=%s",
                                g_mqttConfig.host,
                                static_cast<unsigned>(g_mqttConfig.port),
                                Esp32BaseMqtt::errorName(error),
                                static_cast<long>(raw.espError),
                                static_cast<long>(raw.tlsError),
                                static_cast<long>(raw.socketError),
                                static_cast<unsigned long>(raw.certificateFlags),
                                g_mqttConfig.username ? "true" : "false");
                if (terminal) {
                    emitApplicationEvent(Esp32BaseMqtt::EVENT_CONNECTION_REJECTED, error);
                }
                break;
            }
            case RAW_CONFIGURATION_FAILED: {
                portENTER_CRITICAL(&g_mqttMux);
                g_mqttLastError = raw.espError == ESP_ERR_NO_MEM
                                      ? Esp32BaseMqtt::ERROR_NO_MEMORY
                                      : Esp32BaseMqtt::ERROR_INVALID_CONFIGURATION;
                g_mqttDiagnostics.nativeEspError = raw.espError;
                ++g_mqttDiagnostics.connectionConfigurationFailures;
                g_mqttConnectionWanted = false;
                portEXIT_CRITICAL(&g_mqttMux);
                g_mqttConnectionConfigurationFailed = true;
                setState(Esp32BaseMqtt::CONFIGURATION_ERROR);
                ESP32BASE_LOG_E("mqtt",
                                "connection_configuration_update_failed esp=%ld",
                                static_cast<long>(raw.espError));
                break;
            }
            case RAW_DISCONNECTED: {
                portENTER_CRITICAL(&g_mqttMux);
                g_mqttLastError = g_mqttPendingDisconnectError;
                const Esp32BaseMqtt::Error disconnectError =
                    g_mqttPendingDisconnectError;
                g_mqttPendingDisconnectError =
                    Esp32BaseMqtt::ERROR_DISCONNECTED;
                ++g_mqttDiagnostics.disconnects;
                portEXIT_CRITICAL(&g_mqttMux);
                // Reject re-entrant publish() calls from the events below
                // before refining the prerequisite-specific waiting state.
                setState(Esp32BaseMqtt::BACKOFF);
                clearInflight(true);
                emitApplicationEvent(Esp32BaseMqtt::EVENT_DISCONNECTED,
                                     disconnectError);
                if (g_mqttShutdownActive) {
                    if (g_mqttShutdownResult == Esp32BaseMqtt::SHUTDOWN_IN_PROGRESS) {
                        g_mqttShutdownResult = g_mqttShutdownAcked
                            ? Esp32BaseMqtt::SHUTDOWN_SUCCESS
                            : Esp32BaseMqtt::SHUTDOWN_CONNECTION_LOST;
                    }
                    setState(Esp32BaseMqtt::STOPPING);
                } else if (g_mqttForceReconnectAfterDisconnect) {
                    g_mqttForceReconnectAfterDisconnect = false;
                    portENTER_CRITICAL(&g_mqttMux);
                    g_mqttConnectionWanted = true;
                    portEXIT_CRITICAL(&g_mqttMux);
                    g_mqttBackoffStep = 0;
                    g_mqttNextAttemptMs = millis();
                    setState(Esp32BaseMqtt::BACKOFF);
                } else if (g_mqttConnectionConfigurationFailed) {
                    setState(Esp32BaseMqtt::CONFIGURATION_ERROR);
                } else if (g_mqttTerminalRejection) {
                    setState(Esp32BaseMqtt::CONNECTION_REJECTED);
                } else if (g_mqttOtaSuspended) {
                    setState(Esp32BaseMqtt::SUSPENDED_FOR_OTA);
                } else if (!Esp32BaseWiFi::isConnected()) {
                    setState(Esp32BaseMqtt::WAITING_FOR_WIFI);
                } else if (g_mqttConfig.security == Esp32BaseMqtt::TLS &&
                           !Esp32BaseTime::isRealTime()) {
                    setState(Esp32BaseMqtt::WAITING_FOR_TIME);
                } else if (!isConnectionWanted()) {
                    setState(Esp32BaseMqtt::BACKOFF);
                } else {
                    scheduleBackoff();
                }
                break;
            }
            case RAW_SUBSCRIBED: {
                if (raw.packetId < 0) {
                    const uint8_t index =
                        static_cast<uint8_t>(-1 - raw.packetId);
                    emitApplicationEvent(Esp32BaseMqtt::EVENT_SUBSCRIPTION_REJECTED,
                                         Esp32BaseMqtt::ERROR_SUBSCRIBE_FAILED,
                                         0,
                                         index);
                    break;
                }
                uint8_t index = MQTT_NO_SLOT;
                portENTER_CRITICAL(&g_mqttMux);
                for (uint8_t i = 0; i < g_mqttSubscriptionCount; ++i) {
                    if (g_mqttSubscriptions[i].pendingPacketId == raw.packetId) {
                        index = i;
                        g_mqttSubscriptions[i].pendingPacketId = -1;
                        if (!raw.subscriptionRejected) {
                            ++g_mqttDiagnostics.subscriptionAcknowledged;
                        }
                        break;
                    }
                }
                portEXIT_CRITICAL(&g_mqttMux);
                emitApplicationEvent(
                    raw.subscriptionRejected
                        ? Esp32BaseMqtt::EVENT_SUBSCRIPTION_REJECTED
                        : Esp32BaseMqtt::EVENT_SUBSCRIPTION_ACKNOWLEDGED,
                    raw.subscriptionRejected
                        ? Esp32BaseMqtt::ERROR_SUBSCRIBE_FAILED
                        : Esp32BaseMqtt::ERROR_NONE,
                    static_cast<uint16_t>(raw.packetId),
                    index,
                    raw.grantedQos);
                break;
            }
            case RAW_PUBLISHED: {
                bool found = false;
                portENTER_CRITICAL(&g_mqttMux);
                for (uint8_t i = 0; i < ESP32BASE_MQTT_MAX_INFLIGHT_QOS1; ++i) {
                    if (g_mqttInflight[i].used &&
                        g_mqttInflight[i].packetId == raw.packetId) {
                        g_mqttInflight[i].used = false;
                        ++g_mqttDiagnostics.publishAcknowledged;
                        found = true;
                        break;
                    }
                }
                portEXIT_CRITICAL(&g_mqttMux);
                if (found) {
                    if (g_mqttShutdownActive &&
                        g_mqttShutdownResult == Esp32BaseMqtt::SHUTDOWN_IN_PROGRESS &&
                        raw.packetId == g_mqttShutdownPacket) {
                        g_mqttShutdownAcked = true;
                        if (requestNativeDisconnect() != ESP_OK) {
                            g_mqttShutdownResult = Esp32BaseMqtt::SHUTDOWN_DISCONNECT_FAILED;
                        }
                    }
                    emitApplicationEvent(Esp32BaseMqtt::EVENT_PUBLISH_ACKNOWLEDGED,
                                         Esp32BaseMqtt::ERROR_NONE,
                                         static_cast<uint16_t>(raw.packetId));
                }
                break;
            }
        }
    }
}

void dispatchIncomingMessages() {
    for (uint8_t i = 0; i < ESP32BASE_MQTT_INCOMING_SLOTS; ++i) {
        if (g_mqttShutdownActive) return;
        bool ready = false;
        portENTER_CRITICAL(&g_mqttMux);
        if (g_mqttIncoming[i].state == INCOMING_READY) {
            g_mqttIncoming[i].state = INCOMING_DISPATCHING;
            ready = true;
        }
        portEXIT_CRITICAL(&g_mqttMux);
        if (!ready) {
            continue;
        }

