tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
        IncomingSlot& slot = g_mqttIncoming[i];
        if (g_mqttMessageCallback) {
            Esp32BaseMqtt::MessageView view;
            view.topic = slot.topic;
            view.topicLength = slot.topicLength;
            view.payload = slot.payload;
            view.payloadLength = slot.payloadLength;
            view.qos = slot.qos;
            view.retain = slot.retain;
            view.duplicate = slot.duplicate;
            g_mqttMessageCallback(view, g_mqttMessageContext);
        }
        portENTER_CRITICAL(&g_mqttMux);
        slot.state = INCOMING_EMPTY;
        portEXIT_CRITICAL(&g_mqttMux);
    }
}

bool startMqttClient() {
    if (g_mqttBeforeConnectCallback) {
        g_mqttBeforeConnectCallback(g_mqttBeforeConnectContext);
    }
    Esp32BaseMqtt::Error validationError = Esp32BaseMqtt::ERROR_NONE;
    if (!validateConnectionConfig(g_mqttConfig, validationError)) {
        portENTER_CRITICAL(&g_mqttMux);
        ++g_mqttDiagnostics.connectionConfigurationFailures;
        g_mqttConnectionWanted = false;
        portEXIT_CRITICAL(&g_mqttMux);
        g_mqttConnectionConfigurationFailed = true;
        setLastError(validationError);
        setState(Esp32BaseMqtt::CONFIGURATION_ERROR);
        ESP32BASE_LOG_E("mqtt",
                        "connection_configuration_invalid error=%s",
                        Esp32BaseMqtt::errorName(validationError));
        return false;
    }
    portENTER_CRITICAL(&g_mqttMux);
    ++g_mqttDiagnostics.connectAttempts;
    g_mqttConnectionWanted = true;
    portEXIT_CRITICAL(&g_mqttMux);
    if (g_mqttClient) {
        setState(Esp32BaseMqtt::CONNECTING);
        const esp_err_t result = esp_mqtt_client_reconnect(g_mqttClient);
        if (result != ESP_OK) {
            portENTER_CRITICAL(&g_mqttMux);
            g_mqttDiagnostics.nativeEspError = result;
            portEXIT_CRITICAL(&g_mqttMux);
            setLastError(Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT);
            scheduleBackoff();
            return false;
        }
        return true;
    }

    esp_mqtt_client_config_t nativeConfig;
    fillNativeConfig(nativeConfig);
    g_mqttClient = esp_mqtt_client_init(&nativeConfig);
    if (!g_mqttClient) {
        setLastError(Esp32BaseMqtt::ERROR_NO_MEMORY);
        portENTER_CRITICAL(&g_mqttMux);
        ++g_mqttDiagnostics.enqueueFailures;
        portEXIT_CRITICAL(&g_mqttMux);
        scheduleBackoff();
        return false;
    }
    if (esp_mqtt_client_register_event(
            g_mqttClient, MQTT_EVENT_ANY, mqttEventHandler, nullptr) != ESP_OK) {
        setLastError(Esp32BaseMqtt::ERROR_NO_MEMORY);
        destroyUnstartedMqttClient();
        scheduleBackoff();
        return false;
    }
    setState(Esp32BaseMqtt::CONNECTING);
    const esp_err_t result = esp_mqtt_client_start(g_mqttClient);
    if (result != ESP_OK) {
        portENTER_CRITICAL(&g_mqttMux);
        g_mqttDiagnostics.nativeEspError = result;
        portEXIT_CRITICAL(&g_mqttMux);
        setLastError(result == ESP_ERR_NO_MEM
                         ? Esp32BaseMqtt::ERROR_NO_MEMORY
                         : Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT);
        destroyUnstartedMqttClient();
        scheduleBackoff();
        return false;
    }
    return true;
}

uint8_t inflightCountLocked() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_MQTT_MAX_INFLIGHT_QOS1; ++i) {
        if (g_mqttInflight[i].used) {
            ++count;
        }
    }
    return count;
}

uint8_t reserveInflightSlot() {
    uint8_t index = MQTT_NO_SLOT;
    portENTER_CRITICAL(&g_mqttMux);
    for (uint8_t i = 0; i < ESP32BASE_MQTT_MAX_INFLIGHT_QOS1; ++i) {
        if (!g_mqttInflight[i].used) {
            g_mqttInflight[i].used = true;
            index = i;
            break;
        }
    }
    portEXIT_CRITICAL(&g_mqttMux);
    return index;
}

void releaseInflightSlot(uint8_t index) {
    if (index >= ESP32BASE_MQTT_MAX_INFLIGHT_QOS1) {
        return;
    }
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttInflight[index].used = false;
    portEXIT_CRITICAL(&g_mqttMux);
}

} // namespace

bool Esp32BaseMqtt::configure(const ConnectionConfig& config) {
    g_mqttConfigurationAttempted = true;
    Error validationError = ERROR_NONE;
    if (g_mqttBegun || !validateConnectionConfig(config, validationError)) {
        g_mqttConfigured = false;
        setState(CONFIGURATION_ERROR);
        setLastError(g_mqttBegun ? ERROR_INVALID_CONFIGURATION
                                 : validationError);
        return false;
    }

    g_mqttConfig = config;
    g_mqttConnectionConfigurationFailed = false;
    g_mqttConfigured = true;
    setState(WAITING_FOR_WIFI);
    setLastError(ERROR_NONE);
    return true;
}

bool Esp32BaseMqtt::addSubscription(const Subscription& subscription) {
    if (g_mqttBegun || !validTopicFilter(subscription.topicFilter) ||
        (subscription.qos != QOS_0 && subscription.qos != QOS_1)) {
        setLastError(ERROR_INVALID_CONFIGURATION);
        return false;
    }
    if (g_mqttSubscriptionCount >= ESP32BASE_MQTT_MAX_SUBSCRIPTIONS) {
        setLastError(ERROR_SUBSCRIPTION_LIMIT);
        return false;
    }
    for (uint8_t i = 0; i < g_mqttSubscriptionCount; ++i) {
        if (strcmp(g_mqttSubscriptions[i].topicFilter,
                   subscription.topicFilter) == 0) {
            setLastError(ERROR_INVALID_CONFIGURATION);
            return false;
        }
    }
    SubscriptionEntry& entry = g_mqttSubscriptions[g_mqttSubscriptionCount++];
    entry.topicFilter = subscription.topicFilter;
    entry.qos = subscription.qos;
    entry.pendingPacketId = -1;
    return true;
}

bool Esp32BaseMqtt::setBeforeConnectCallback(BeforeConnectCallback callback,
                                               void* context) {
    if (g_mqttBegun) {
        setLastError(ERROR_INVALID_CONFIGURATION);
        return false;
    }
    g_mqttBeforeConnectCallback = callback;
    g_mqttBeforeConnectContext = context;
    return true;
}

void Esp32BaseMqtt::setMessageCallback(MessageCallback callback, void* context) {
    g_mqttMessageCallback = callback;
    g_mqttMessageContext = context;
}

void Esp32BaseMqtt::setEventCallback(EventCallback callback, void* context) {
    g_mqttEventCallback = callback;
    g_mqttEventContext = context;
}

