tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
Esp32BaseMqtt::PublishResult Esp32BaseMqtt::publish(const PublishRequest& request) {
    PublishResult result;
    if (!g_mqttConfigured) {
        result.code = PUBLISH_NOT_CONFIGURED;
        return result;
    }
    if (g_mqttShutdownActive || g_mqttState != CONNECTED || !g_mqttClient) {
        result.code = PUBLISH_NOT_CONNECTED;
        setLastError(ERROR_NOT_CONNECTED);
        return result;
    }
    if (!request.topic || request.topic[0] == '\0' ||
        strchr(request.topic, '#') || strchr(request.topic, '+')) {
        result.code = PUBLISH_INVALID_TOPIC;
        setLastError(ERROR_INVALID_CONFIGURATION);
        return result;
    }
    if (boundedLength(request.topic, ESP32BASE_MQTT_MAX_TOPIC_BYTES) >
        ESP32BASE_MQTT_MAX_TOPIC_BYTES) {
        result.code = PUBLISH_TOPIC_TOO_LONG;
        setLastError(ERROR_TOPIC_TOO_LONG);
        return result;
    }
    if (request.payloadLength > 0 && !request.payload) {
        result.code = PUBLISH_INVALID_PAYLOAD;
        setLastError(ERROR_INVALID_CONFIGURATION);
        return result;
    }
    if (request.payloadLength > ESP32BASE_MQTT_MAX_PAYLOAD_BYTES) {
        result.code = PUBLISH_PAYLOAD_TOO_LONG;
        setLastError(ERROR_PAYLOAD_TOO_LONG);
        return result;
    }
    if (request.qos != QOS_0 && request.qos != QOS_1) {
        result.code = PUBLISH_INVALID_QOS;
        setLastError(ERROR_INVALID_CONFIGURATION);
        return result;
    }

    const int currentOutbox = esp_mqtt_client_get_outbox_size(g_mqttClient);
    const size_t estimatedPacketBytes =
        strlen(request.topic) + request.payloadLength + 32;
    if (currentOutbox < 0 ||
        static_cast<size_t>(currentOutbox) + estimatedPacketBytes >
            ESP32BASE_MQTT_MAX_OUTBOX_BYTES) {
        result.code = PUBLISH_OUTBOX_FULL;
        setLastError(ERROR_OUTBOX_FULL);
        return result;
    }

    uint8_t inflightSlot = MQTT_NO_SLOT;
    if (request.qos == QOS_1) {
        inflightSlot = reserveInflightSlot();
        if (inflightSlot == MQTT_NO_SLOT) {
            result.code = PUBLISH_INFLIGHT_LIMIT;
            setLastError(ERROR_INFLIGHT_LIMIT);
            return result;
        }
    }

    const int packetId = esp_mqtt_client_enqueue(
        g_mqttClient,
        request.topic,
        reinterpret_cast<const char*>(request.payload),
        static_cast<int>(request.payloadLength),
        static_cast<int>(request.qos),
        request.retain ? 1 : 0,
        true);
    if (packetId < 0) {
        releaseInflightSlot(inflightSlot);
        portENTER_CRITICAL(&g_mqttMux);
        ++g_mqttDiagnostics.enqueueFailures;
        portEXIT_CRITICAL(&g_mqttMux);
        result.code = packetId == -2 ? PUBLISH_OUTBOX_FULL : PUBLISH_NO_MEMORY;
        setLastError(packetId == -2 ? ERROR_OUTBOX_FULL : ERROR_NO_MEMORY);
        return result;
    }

    if (request.qos == QOS_1) {
        portENTER_CRITICAL(&g_mqttMux);
        g_mqttInflight[inflightSlot].packetId = static_cast<uint16_t>(packetId);
        portEXIT_CRITICAL(&g_mqttMux);
    }
    const int outboxAfter = esp_mqtt_client_get_outbox_size(g_mqttClient);
    portENTER_CRITICAL(&g_mqttMux);
    ++g_mqttDiagnostics.publishAccepted;
    if (outboxAfter > 0 &&
        outboxAfter > g_mqttDiagnostics.outboxHighWaterBytes) {
        g_mqttDiagnostics.outboxHighWaterBytes =
            static_cast<uint16_t>(outboxAfter > UINT16_MAX ? UINT16_MAX : outboxAfter);
    }
    portEXIT_CRITICAL(&g_mqttMux);
    result.code = PUBLISH_ACCEPTED;
    result.packetId = request.qos == QOS_1
                          ? static_cast<uint16_t>(packetId)
                          : 0;
    return result;
}

bool Esp32BaseMqtt::beginShutdown(const PublishRequest& message, uint32_t timeoutMs) {
    if (g_mqttShutdownActive) return false;
    if (!timeoutMs || timeoutMs > 0x7fffffffUL || message.qos != QOS_1 ||
        !validPublishTopic(message.topic) || (message.payloadLength && !message.payload) ||
        message.payloadLength > ESP32BASE_MQTT_MAX_PAYLOAD_BYTES) {
        g_mqttShutdownResult = SHUTDOWN_INVALID_REQUEST;
        return false;
    }
    if (!g_mqttBegun || !g_mqttConfigured || state() != CONNECTED) {
        g_mqttShutdownResult = SHUTDOWN_NOT_CONNECTED;
        return false;
    }
    const PublishResult queued = publish(message);
    if (!queued.accepted()) {
        g_mqttShutdownResult = SHUTDOWN_PUBLISH_FAILED;
        return false;
    }
    g_mqttShutdownActive = true;
    g_mqttShutdownAcked = false;
    g_mqttShutdownPacket = queued.packetId;
    g_mqttShutdownDeadline = millis() + timeoutMs;
    g_mqttShutdownResult = SHUTDOWN_IN_PROGRESS;
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttReconnectRequested = false;
    g_mqttShutdownMailboxDrops = g_mqttDiagnostics.controlEventDropped;
    portEXIT_CRITICAL(&g_mqttMux);
    g_mqttForceReconnectAfterDisconnect = false;
    setState(STOPPING);
    return true;
}

Esp32BaseMqtt::ShutdownResult Esp32BaseMqtt::shutdownResult() { return g_mqttShutdownResult; }
bool Esp32BaseMqtt::shutdownPaused() { return g_mqttShutdownActive; }

void Esp32BaseMqtt::resumeAfterShutdown() {
    if (!g_mqttShutdownActive) return;
    g_mqttShutdownActive = false;
    g_mqttShutdownPacket = 0;
    // Resume always opens a new connection cycle, never reuses a retained
    // shutdown session. Read transport truth even if a mailbox event was lost.
    portENTER_CRITICAL(&g_mqttMux);
    const bool connected = g_mqttNativeConnected;
    portEXIT_CRITICAL(&g_mqttMux);
    setState(connected ? CONNECTED : BACKOFF);
    requestReconnect();
}

bool Esp32BaseMqtt::requestReconnect() {
    if (g_mqttShutdownActive || !g_mqttBegun || !g_mqttConfigured) {
        return false;
    }
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttReconnectRequested = true;
    portEXIT_CRITICAL(&g_mqttMux);
    return true;
}

bool Esp32BaseMqtt::begin() {
    g_mqttBegun = true;
    if (g_mqttConfigurationAttempted && !g_mqttConfigured) {
        return false;
    }
    if (!g_mqttConfigured) {
        setState(NOT_CONFIGURED);
        ESP32BASE_LOG_I("mqtt", "not_configured enabled=true");
        return true;
    }
    portENTER_CRITICAL(&g_mqttMux);
    g_mqttConnectionWanted = true;
    portEXIT_CRITICAL(&g_mqttMux);
    setState(WAITING_FOR_WIFI);
    ESP32BASE_LOG_I("mqtt",
                    "configured host=%s port=%u client_id=%s tls=%s certificate_date_check=%s credential_set=%s client_certificate_set=%s clean_session=true",
                    g_mqttConfig.host,
                    static_cast<unsigned>(g_mqttConfig.port),
                    g_mqttConfig.clientId,
                    g_mqttConfig.security == TLS ? "true" : "false",
                    MQTT_CERTIFICATE_DATE_CHECK_ENABLED ? "true" : "false",
                    g_mqttConfig.username ? "true" : "false",
                    g_mqttConfig.tls.clientCertificatePem ? "true" : "false");
    return true;
}

void esp32base_internal::suspendMqttForOta() {
    if (!g_mqttConfigured && !g_mqttConfigurationAttempted) {
        return;
    }
    if (g_mqttShutdownActive && g_mqttShutdownResult != Esp32BaseMqtt::SHUTDOWN_SUCCESS) return;
    if (!g_mqttOtaSuspended) {
        g_mqttOtaSuspended = true;
        g_mqttForceReconnectAfterDisconnect = false;
        requestNativeDisconnect();
        setState(Esp32BaseMqtt::SUSPENDED_FOR_OTA);
        ESP32BASE_LOG_I("mqtt", "suspended reason=ota_upload");
    }
}

void Esp32BaseMqtt::handle(bool otaUploading) {
    if (!g_mqttConfigured && !g_mqttConfigurationAttempted) {
        return;
    }

    if (otaUploading) {
        esp32base_internal::suspendMqttForOta();
    } else if (g_mqttOtaSuspended && g_mqttShutdownActive) {
        g_mqttOtaSuspended = false;
        resumeAfterShutdown();
    }

    if (g_mqttShutdownActive && g_mqttShutdownResult == SHUTDOWN_IN_PROGRESS) {
        portENTER_CRITICAL(&g_mqttMux);
        const bool lostEvent = g_mqttDiagnostics.controlEventDropped != g_mqttShutdownMailboxDrops;
        portEXIT_CRITICAL(&g_mqttMux);
        if (lostEvent) g_mqttShutdownResult = SHUTDOWN_DELIVERY_UNCERTAIN;
        else if (deadlineReached(millis(), g_mqttShutdownDeadline)) {
            g_mqttShutdownResult = g_mqttShutdownAcked
                ? SHUTDOWN_DISCONNECT_TIMEOUT : SHUTDOWN_PUBACK_TIMEOUT;
        }
    }
    handleRawEvents();
    if (!g_mqttOtaSuspended && !g_mqttShutdownActive &&
        !g_mqttReconnectRequested && isConnectionWanted()) {
        dispatchIncomingMessages();
    }
    dispatchMailboxOverflowIfNeeded();
    dispatchIncomingDropIfNeeded();

    if (g_mqttShutdownActive) {
        // No normal DISCONNECT before a proven final PUBACK: it would suppress
        // LWT while leaving an obsolete retained online message at the Broker.
        setState(STOPPING);
        return;
    }

