tangyangguang/Esp32Base/src/network/Esp32BaseMqtt.inc
    if (!g_mqttConfigured) {
        return;
    }
    bool reconnectRequested = false;
    portENTER_CRITICAL(&g_mqttMux);
    reconnectRequested = g_mqttReconnectRequested;
    g_mqttReconnectRequested = false;
    portEXIT_CRITICAL(&g_mqttMux);
    if (otaUploading) {
        return;
    }
    if (g_mqttOtaSuspended) {
        g_mqttOtaSuspended = false;
        portENTER_CRITICAL(&g_mqttMux);
        g_mqttConnectionWanted = true;
        portEXIT_CRITICAL(&g_mqttMux);
        g_mqttNextAttemptMs = millis();
        g_mqttBackoffStep = 0;
    }
    if (reconnectRequested) {
        g_mqttTerminalRejection = false;
        g_mqttConnectionConfigurationFailed = false;
        setLastError(ERROR_NONE);
        g_mqttBackoffStep = 0;
        g_mqttNextAttemptMs = millis();
        if (g_mqttState == CONNECTED || g_mqttState == CONNECTING) {
            g_mqttForceReconnectAfterDisconnect = true;
            requestNativeDisconnect();
        } else {
            portENTER_CRITICAL(&g_mqttMux);
            g_mqttConnectionWanted = true;
            portEXIT_CRITICAL(&g_mqttMux);
            setState(BACKOFF);
        }
        return;
    }
    if (g_mqttConnectionConfigurationFailed ||
        g_mqttState == CONFIGURATION_ERROR) {
        return;
    }
    if (g_mqttTerminalRejection &&
        g_mqttState != CONNECTION_REJECTED) {
        setState(CONNECTION_REJECTED);
    }
    if (g_mqttTerminalRejection ||
        g_mqttState == CONNECTION_REJECTED) {
        return;
    }
    if (!Esp32BaseWiFi::isConnected()) {
        if (isConnectionWanted()) {
            requestNativeDisconnect();
        }
        setState(WAITING_FOR_WIFI);
        return;
    }
    const Esp32BaseTime::Snapshot time = Esp32BaseTime::snapshot();
    if (g_mqttConfig.security == TLS &&
        (!time.synced || time.source != Esp32BaseTime::SOURCE_NTP)) {
        if (isConnectionWanted()) {
            requestNativeDisconnect();
        }
        setState(WAITING_FOR_TIME);
        return;
    }
    if (!isConnectionWanted()) {
        portENTER_CRITICAL(&g_mqttMux);
        g_mqttConnectionWanted = true;
        portEXIT_CRITICAL(&g_mqttMux);
        g_mqttBackoffStep = 0;
        g_mqttNextAttemptMs = millis();
        setState(BACKOFF);
    }
    if (g_mqttState == CONNECTED || g_mqttState == CONNECTING) {
        return;
    }
    const uint32_t now = millis();
    if (!deadlineReached(now, g_mqttNextAttemptMs)) {
        setState(BACKOFF);
        return;
    }
    startMqttClient();
}

bool Esp32BaseMqtt::settleShutdownForMaintenance(uint16_t maximumWaitMs) {
    if (!g_mqttShutdownActive) return true;
    if (maximumWaitMs > 1000) maximumWaitMs = 1000;
    g_mqttMaintenanceDraining = true;
    for (uint16_t waited = 0; g_mqttShutdownResult == SHUTDOWN_IN_PROGRESS &&
                              waited < maximumWaitMs; ++waited) {
        handle(false);
        if (g_mqttShutdownResult == SHUTDOWN_IN_PROGRESS) delay(1);
    }
    g_mqttMaintenanceDraining = false;
    if (g_mqttShutdownResult == SHUTDOWN_IN_PROGRESS) {
        g_mqttShutdownResult = g_mqttShutdownAcked
            ? SHUTDOWN_DISCONNECT_TIMEOUT : SHUTDOWN_PUBACK_TIMEOUT;
    }
    return g_mqttShutdownResult == SHUTDOWN_SUCCESS;
}

void Esp32BaseMqtt::prepareForLifecycleStop() {
    // Forced restart/sleep still proceeds, but must not suppress LWT after
    // failed final delivery. Successful explicit shutdown is already closed.
    if (g_mqttShutdownActive) return;
    if (!g_mqttBegun) {
        return;
    }
    setState(STOPPING);
    clearInflight(false);
    requestNativeDisconnect();
}

Esp32BaseMqtt::State Esp32BaseMqtt::state() {
    portENTER_CRITICAL(&g_mqttMux);
    const State current = g_mqttState;
    portEXIT_CRITICAL(&g_mqttMux);
    return current;
}

Esp32BaseMqtt::Status Esp32BaseMqtt::status() {
    Status snapshot;
    portENTER_CRITICAL(&g_mqttMux);
    snapshot.state = g_mqttState;
    snapshot.lastError = g_mqttLastError;
    snapshot.configured = g_mqttConfigured;
    snapshot.connectedAtUptimeMs = g_mqttConnectedAtUptimeMs;
    snapshot.connectedAtEpochSec = g_mqttConnectedAtEpochSec;
    portEXIT_CRITICAL(&g_mqttMux);
    snapshot.tls = g_mqttConfig.security == TLS;
    snapshot.certificateDateCheckEnabled =
        MQTT_CERTIFICATE_DATE_CHECK_ENABLED;
    snapshot.usernameSet = g_mqttConfig.username != nullptr;
    snapshot.clientCertificateSet =
        g_mqttConfig.tls.clientCertificatePem != nullptr;
    snapshot.host = g_mqttConfigured ? g_mqttConfig.host : nullptr;
    snapshot.port = g_mqttConfigured ? g_mqttConfig.port : 0;
    snapshot.clientId = g_mqttConfigured ? g_mqttConfig.clientId : nullptr;
    return snapshot;
}

Esp32BaseMqtt::Diagnostics Esp32BaseMqtt::diagnostics() {
    portENTER_CRITICAL(&g_mqttMux);
    Diagnostics snapshot = g_mqttDiagnostics;
    snapshot.inflightQos1 = inflightCountLocked();
    portEXIT_CRITICAL(&g_mqttMux);
    return snapshot;
}

const char* Esp32BaseMqtt::stateName(State stateValue) {
    switch (stateValue) {
        case NOT_CONFIGURED: return "not_configured";
        case CONFIGURATION_ERROR: return "configuration_error";
        case WAITING_FOR_WIFI: return "waiting_for_wifi";
        case WAITING_FOR_TIME: return "waiting_for_time";
        case BACKOFF: return "backoff";
        case CONNECTING: return "connecting";
        case CONNECTED: return "connected";
        case CONNECTION_REJECTED: return "connection_rejected";
        case SUSPENDED_FOR_OTA: return "suspended_for_ota";
        case STOPPING: return "stopping";
        default: return "unknown";
    }
}

const char* Esp32BaseMqtt::errorName(Error errorValue) {
    switch (errorValue) {
        case ERROR_NONE: return "none";
        case ERROR_INVALID_CONFIGURATION: return "invalid_configuration";
        case ERROR_NOT_CONNECTED: return "not_connected";
        case ERROR_TOPIC_TOO_LONG: return "topic_too_long";
        case ERROR_PAYLOAD_TOO_LONG: return "payload_too_long";
        case ERROR_SUBSCRIPTION_LIMIT: return "subscription_limit";
        case ERROR_INFLIGHT_LIMIT: return "inflight_limit";
        case ERROR_OUTBOX_FULL: return "outbox_full";
        case ERROR_NO_MEMORY: return "no_memory";
        case ERROR_SUBSCRIBE_FAILED: return "subscribe_failed";
        case ERROR_DNS_OR_TRANSPORT: return "dns_or_transport";
        case ERROR_TLS: return "tls";
        case ERROR_TLS_CERTIFICATE: return "tls_certificate";
        case ERROR_TLS_CERTIFICATE_DATE_CHECK_UNAVAILABLE:
            return "tls_certificate_date_check_unavailable";
        case ERROR_BROKER_UNAVAILABLE: return "broker_unavailable";
        case ERROR_PROTOCOL_REJECTED: return "protocol_rejected";
        case ERROR_CLIENT_ID_REJECTED: return "client_id_rejected";
        case ERROR_BAD_CREDENTIALS: return "bad_credentials";
        case ERROR_NOT_AUTHORIZED: return "not_authorized";
        case ERROR_DISCONNECTED: return "disconnected";
        default: return "unknown";
    }
}
